smooker/stm32f411ceu6/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "defines.h"
#include "stdarg.h"
#include "usb_device.h"
#include "usbd_cdc_if.h"
#include "stm32f4xx_hal.h" // Example for F4
#include "eeprom_emul_uint32_t.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

union {
    float f;
    uint32_t u;
} float2uint;

typedef struct
{
  // float mmpsmax;          // velocity maximum
  union {
      float f;
      uint32_t u;
  } mmpsmax;

  // float mmpsmin;          // velocity minimum
  union {
      float f;
      uint32_t u;
  } mmpsmin;

  // float dvdtacc;          // acceleration
  union {
      float f;
      uint32_t u;
  } dvdtacc;

  // float dvdtdecc;         // decceleration
  union {
      float f;
      uint32_t u;
  } dvdtdecc;

  // float jogmm;            // jog units
  union {
      float f;
      uint32_t u;
  } jogmm;

  // float stepmm;           // step units
  union {
      float f;
      uint32_t u;
  } stepmm;

  // uint32_t spmm;          // steps per mm (conversational unit)
  union {
      float f;
      uint32_t u;
  } spmm;
} params_t;

typedef enum {
    KEY_NONE,
    KEY_SEQUENCE,
    KEY_UP,
    KEY_DOWN,
    KEY_LEFT,
    KEY_RIGHT,
    KEY_ESC,
    KEY_ENTER,
    KEY_BACKSPACE,
    KEY_CLEAR,
    KEY_F1,
    KEY_F2,
    KEY_F3,
    KEY_F4,
} KeyCode;

typedef enum {
    SEQ_IDLE,
    SEQ_ESC,
    SEQ_BRACKET,
    SEQ_O,
} SeqState;

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define dotTime       60
#define interTime     dotTime
#define dashTime      3*dotTime
#define spaceTime     7*dotTime

void dot();
void dash();
uint8_t morse(const char *format, ... );
uint8_t CDC_TxWrite(const uint8_t *data, uint16_t len);

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

//Externs
extern PCD_HandleTypeDef hpcd_USB_OTG_FS;
extern USBD_HandleTypeDef hUsbDeviceFS;

//
#define RX_BUF_SIZE  512
static uint8_t UserTxBufferFS[RX_BUF_SIZE];
static volatile uint16_t txLen   = 0;
static volatile uint8_t  txBusy  = 0;

//
#define TX_BUF_SIZE  512
static uint8_t UserRxBufferFS[TX_BUF_SIZE];
static volatile uint16_t rxHead = 0;
static volatile uint16_t rxTail = 0;
//
extern uint8_t CDC_IsConnected;

// Locals
params_t params;

static uint8_t  lineBuf[128];
static uint16_t lineLen = 0;

//
uint32_t semaphore = 0;    // state machine flags

// morse code letters and digits
// __attribute__((section(".rodata"))) const char* morseCode[] = {
const char* morseCode[] = {
    "-----",            // 0
    ".----",            // 1
    "..---",            // 2
    "...--",            // 3
    "....-",            // 4
    ".....",            // 5
    "-....",            // 6
    "--...",            // 7
    "---..",            // 8
    "----.",            // 9
    ".-",               // A
    "-...",             // B
    "-.-.",             // C
    "-..",              // D
    ".",                // E
    "..-.",             // F
    "--.",              // G
    "....",             // H
    "..",               // I
    ".---",             // J
    "-.-",              // K
    ".-..",             // L
    "--",               // M
    "-.",               // N
    "---",              // O
    ".--.",             // P
    "--.-",             // Q
    ".-.",              // R
    "...",              // S
    "-",                // T
    "..-",              // U
    "...-",             // V
    ".--",              // W
    "-..-",             // X
    "-.--",             // Y
    "--..",             // Z
};   //morse code from A to Z

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

//
KeyCode ParseKey(uint8_t byte)
{
    static SeqState state = SEQ_IDLE;

    switch (state)
    {
    case SEQ_IDLE:
        if      (byte == 0x1B) { state = SEQ_ESC;               return KEY_SEQUENCE; }
        else if (byte == '\r' || byte == '\n' || byte == 0x8D)  return KEY_ENTER;
        else if (byte == 0x7F || byte == 0x08 )         return KEY_BACKSPACE;
        else if (byte == 0x0C) {
            return KEY_CLEAR;  // Ctrl+L
        }
        break;

    case SEQ_ESC:
        if (byte == '[') { state = SEQ_BRACKET; return KEY_SEQUENCE; }
        else if (byte == 'O') { state = SEQ_O;       return KEY_SEQUENCE; }
        state = SEQ_IDLE;
        return KEY_ESC;

    case SEQ_O:
        state = SEQ_IDLE;
        if (byte == 'M') return KEY_ENTER;   // keypad Enter
        if (byte == 'P') return KEY_F1;      // bonus: F1-F4 also use ESC O
        if (byte == 'Q') return KEY_F2;
        if (byte == 'R') return KEY_F3;
        if (byte == 'S') return KEY_F4;
        break;

    case SEQ_BRACKET:
        state = SEQ_IDLE;
        if      (byte == 'A') return KEY_UP;
        else if (byte == 'B') return KEY_DOWN;
        else if (byte == 'C') return KEY_RIGHT;
        else if (byte == 'D') return KEY_LEFT;
        break;
    }

    return KEY_NONE;
}

// my memset
void volatile_memset(volatile void *s, int c, size_t n) {
    volatile unsigned char *p = (volatile unsigned char *)s;
    while (n-- > 0) {
        *p++ = (unsigned char)c;
    }
}

// parameters init - for debug purposes only
void initParams()
{
  params.mmpsmax.f  = 1.0012f;    // 1 index
  params.mmpsmin.f  = 1.0023f;    // 2
  params.dvdtacc.f  = 1.0034f;    // 3
  params.dvdtdecc.f = 1.0045f;    // 4
  params.jogmm.f    = 1.0056f;    // 5
  params.stepmm.f   = 1.0067f;    // 6
  params.spmm.u     = 4096;       // 7
}

// debug only
void writeParams()
{
  int16_t index = 0;

  index++;
  if (EEPROM_Write(index, params.mmpsmax.u) != EEPROM_OK) {
    cdcprintf("WRITE 1 FAILED\r\n");
    BKPT;
  }
  index++;
  if (EEPROM_Write(index, params.mmpsmin.u) != EEPROM_OK) {
    cdcprintf("WRITE 2 FAILED\r\n");
    BKPT;
  }
  index++;
  if (EEPROM_Write(index, params.dvdtacc.u) != EEPROM_OK) {
    cdcprintf("WRITE 3 FAILED\r\n");
    BKPT;
  }
  index++;
  if (EEPROM_Write(index, params.dvdtdecc.u) != EEPROM_OK) {
    cdcprintf("WRITE 4 FAILED\r\n");
    BKPT;
  }
  index++;
  if (EEPROM_Write(index, params.jogmm.u) != EEPROM_OK) {
    cdcprintf("WRITE 5 FAILED\r\n");
    BKPT;
  }
  index++;
  if (EEPROM_Write(index, params.stepmm.u) != EEPROM_OK) {
    cdcprintf("WRITE 6 FAILED\r\n");
    BKPT;
  }
  index++;
  if (EEPROM_Write(index, params.spmm.u) != EEPROM_OK) {
    cdcprintf("WRITE 7 FAILED\r\n");
    BKPT;
  }
}

//
void readParams()
{
    int16_t stat;
    uint16_t index = 0;

    index++;
    if ( (stat = EEPROM_Read(index, (uint32_t*)&params.mmpsmax)) != 0) {
        cdcprintf("read %d returned 0x%x\r\n", index, stat);
    }

    index++;
    if ( (stat = EEPROM_Read(index, (uint32_t*)&params.mmpsmin)) != 0) {
        cdcprintf("read %d returned 0x%x\r\n", index, stat);
    }

    index++;
    if ( (stat = EEPROM_Read(index, (uint32_t*)&params.dvdtacc)) != 0) {
        cdcprintf("read %d returned 0x%x\r\n", index, stat);
    }

    index++;
    if ( (stat = EEPROM_Read(index, (uint32_t*)&params.dvdtdecc)) != 0) {
        cdcprintf("read %d returned 0x%x\r\n", index, stat);
    }

    index++;
    if ( (stat = EEPROM_Read(index, (uint32_t*)&params.jogmm)) != 0) {
        cdcprintf("read %d returned 0x%x\r\n", index, stat);
    }

    index++;
    if ( (stat = EEPROM_Read(index, (uint32_t*)&params.stepmm)) != 0) {
        cdcprintf("read %d returned 0x%x\r\n", index, stat);
    }

    index++;
    if ( (stat = EEPROM_Read(index, (uint32_t*)&params.spmm)) != 0) {
        cdcprintf("read %d returned 0x%x\r\n", index, stat);
    }
}

//
void dumpVars()
{
    // readVariables();
    // cdcprintf("----------%08d-----\r\n", debugonly++);
    cdcprintf("Dump of NVARS in EEPROM\r\n");
    cdcprintf("-----------------------\r\n");
    cdcprintf("mmpsmax........: %7.3f\r\n", params.mmpsmax.f );
    cdcprintf("mmpsmin........: %7.3f\r\n", params.mmpsmin.f );
    cdcprintf("dvdtacc........: %7.3f\r\n", params.dvdtacc.f );
    cdcprintf("dvdtdecc.......: %7.3f\r\n", params.dvdtdecc.f );
    cdcprintf("jogmm..........: %7.3f\r\n", params.jogmm.f );
    cdcprintf("stepmm.........: %7.3f\r\n", params.stepmm.f );
    cdcprintf("spmm...........: %7d\r\n",  params.spmm.u );
    cdcprintf("-----------------------\r\n");
    cdcprintf("semaphore....:  %d\r\n", semaphore);
    cdcprintf("SEM_EL.......:  %d\r\n", SEM_EL);
    cdcprintf("SEM_ER.......:  %d\r\n", SEM_ER);
    cdcprintf("SEM_JOGL.....:  %d\r\n", SEM_JOGL);
    cdcprintf("SEM_JOGR.....:  %d\r\n", SEM_JOGR);
    cdcprintf("SEM_JOGSTEPL.:  %d\r\n", SEM_JOGSTEPL);
    cdcprintf("SEM_JOGSTEPR.:  %d\r\n", SEM_JOGSTEPR);
    cdcprintf("-----------------------\r\n");
    cdcprintf("DB_JOGL......:  %d\r\n", DB_JOGL);
    cdcprintf("DB_JOGR......:  %d\r\n", DB_JOGR);
    cdcprintf("DB_STEPL.....:  %d\r\n", DB_STEPL);
    cdcprintf("DB_STEPR.....:  %d\r\n", DB_STEPR);
    cdcprintf("DB_EL........:  %d\r\n", DB_EL);
    cdcprintf("DB_ER........:  %d\r\n", DB_ER);
    cdcprintf("DB_EE........:  %d\r\n", DB_EE);
    cdcprintf("-----------------------\r\n");
}

// morse dot function
void dot()
{
    HAL_GPIO_WritePin(LED_USER_GPIO_Port, LED_USER_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(BUZZ_GPIO_Port, BUZZ_Pin, GPIO_PIN_RESET);

    HAL_Delay(dotTime);

    HAL_GPIO_WritePin(LED_USER_GPIO_Port, LED_USER_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(BUZZ_GPIO_Port, BUZZ_Pin, GPIO_PIN_SET);

    HAL_Delay(interTime);
}

