smooker/stm32f411ceu6/Core/Src/main.c
// morse dash function
void dash()
{
    HAL_GPIO_WritePin(LED_USER_GPIO_Port, LED_USER_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(BUZZ_GPIO_Port, BUZZ_Pin, GPIO_PIN_RESET);

    HAL_Delay(dashTime);

    HAL_GPIO_WritePin(BUZZ_GPIO_Port, BUZZ_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED_USER_GPIO_Port, LED_USER_Pin, GPIO_PIN_SET);

    HAL_Delay(interTime);
}

int _write(int file, char *ptr, int len)
{
    UNUSED(file);

    USBD_CDC_HandleTypeDef *hcdc =
        (USBD_CDC_HandleTypeDef *)hUsbDeviceFS.pClassData;

    /* wait until TX is free */
    uint32_t timeout = HAL_GetTick();
    while (hcdc->TxState != 0)
    {
        if (HAL_GetTick() - timeout > 100)  /* 100ms timeout — avoid infinite hang */
            return 0;
    }

    CDC_Transmit_FS((uint8_t *)ptr, len);

    /* wait for this transmission to complete before returning */
    timeout = HAL_GetTick();
    while (hcdc->TxState != 0)
    {
        if (HAL_GetTick() - timeout > 100)
            return 0;
    }

    return len;
}

// console stdout
uint8_t cdcprintf(const char *format, ... )
{
    uint8_t buffx[256] = {0};

    if (!CDC_IsConnected) {
        // BKPT;
        return 1;
    }

    uint8_t result = USBD_FAIL;

    va_list ap;

    int vsprintfResult;

    va_start(ap, format);
    vsprintfResult = vsprintf((char *)&buffx[0], format, ap);
    if ( vsprintfResult < 0 ) {
        BKPT;
    }
    va_end(ap);

    uint8_t len = strlen((const char*)&buffx);
    CDC_TxWrite(buffx, len);

    return result; //
}

// Morse code transmitter
uint8_t morse(const char *format, ... )
{
    uint8_t result = 0;

    unsigned char lettInMorse[8];

    uint8_t cnt2 = 0;

    uint8_t symbol;
    // uint8_t tmpsymbol;           //needed for CW printout in console

    while ( (symbol = format[cnt2]) > 0)
    {
        // end of string
        if ( symbol == 0x00 ) {
            break;
        }

        // check for alhpa
        if ( ( symbol > 90 ) | ( symbol < 65 ) ) {
          // check for digits
          if ( ( symbol > 57 ) | ( symbol < 48 ) ) {
            if ( symbol != 32 ) {
              BKPT;
              break;
            }
          }
        }

        // convert to pseudoascii
        if ( ( symbol <= 57 ) & ( symbol >= 48 ) ) {
          symbol -= 48;
        }

        // convert to pseudoascii
        if ( ( symbol <= 90 ) & ( symbol >= 65 ) ) {
          symbol -= 55;
        }
        // space handling
        if (symbol == 32) {
            HAL_Delay(spaceTime);
            cnt2++;
            continue;
        }

        uint8_t index = 0;        //indexLett in letter

        while (1) {
            lettInMorse[index] = morseCode[symbol][index];
            if (lettInMorse[index] == 0) {        // end of string
                break;
            }
            if (lettInMorse[index] == '.') {      //dot
                dot();
            }
            if (lettInMorse[index] == '-') {      //dash
                dash();
            }
            index++;
        }
        HAL_Delay(spaceTime);
        cnt2++;
    }
    return result;
}

//
void My_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd)
{
    UNUSED(hpcd);
    BKPT;
}

// USB Physical connection
void My_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd)
{
    UNUSED(hpcd);
}

// USB Physical disconnection
void My_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd)
{
    UNUSED(hpcd);
    CDC_IsConnected = 0;
}

// Many nops
void delay() {
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
        __NOP();
}

// Start Of Frame Handling.
void My_PCD_SOF(PCD_HandleTypeDef *hpcd)
{
    UNUSED(hpcd);
    //fixme. find out why there are two sof needles
    // HAL_GPIO_WritePin(LED_USER_GPIO_Port, LED_USER_Pin, GPIO_PIN_RESET);
    // delay();
    // HAL_GPIO_WritePin(LED_USER_GPIO_Port, LED_USER_Pin, GPIO_PIN_SET);
}

//
static void TxStart(void)
{
    if (txBusy || txLen == 0) return;
    txBusy = 1;
    /* txLen intentionally NOT cleared here — buffer must stay valid */
    uint8_t result = CDC_Transmit_FS(UserTxBufferFS, txLen);
    if (result == USBD_OK)
    {
        txBusy = 1;
        txLen  = 0;
    }
}

//
void MyCDC_Receive_FS(uint8_t *Buf, uint32_t *Len)
{
    for (uint32_t i = 0; i < *Len; i++)
    {
        uint16_t next = (rxHead + 1) % RX_BUF_SIZE;
        if (next != rxTail)
        {
            UserRxBufferFS[rxHead] = Buf[i];
            rxHead = next;
        }
    }
}

/* Read one byte from RX buffer. Call CDC_RxAvailable() first. */
uint8_t CDC_RxAvailable(void)
{
    return rxHead != rxTail;
}

uint8_t CDC_RxRead(void)
{
    uint8_t byte = UserRxBufferFS[rxTail];
    rxTail = (rxTail + 1) % APP_RX_DATA_SIZE;
    return byte;
}

/* Queue bytes for async TX. Returns 0 if TX buffer full. */
uint8_t CDC_TxWrite(const uint8_t *data, uint16_t len)
{
    if (txBusy || (txLen + len) > APP_TX_DATA_SIZE)
        return 0; /* busy or won't fit */

    memcpy(&UserTxBufferFS[txLen], data, len);
    txLen += len;
    TxStart();
    return 1;
}

// DataOut is from HOST to DEVICE
static void MyPCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
    USBD_LL_DataOutStage((USBD_HandleTypeDef *)hpcd->pData, epnum,
                         hpcd->OUT_ep[epnum].xfer_buff);
}

// DataIn is from DEVICE to HOST
void MyPCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
    USBD_LL_DataInStage((USBD_HandleTypeDef *)hpcd->pData, epnum,
                        hpcd->IN_ep[epnum].xfer_buff);

    if (epnum == 0x01)
    {
        txLen  = 0;   // ← clear here, AFTER hardware is done with the buffer
        txBusy = 0;
        TxStart();    // send next chunk if queued in the meantime
    }
}

// Debug some USB options
void debugStruc()
{
    USB_CfgTypeDef *usb = &hpcd_USB_OTG_FS.Init;
    cdcprintf("#########################################\r\n");
    cdcprintf("sizeof float is %d bytes\r\n", sizeof(float));
    cdcprintf("-----------------------------------------\r\n");
    cdcprintf("hpcd_USB_OTG_FS.Init.dev_endpoints:%d\r\n", usb->dev_endpoints);
    cdcprintf("hpcd_USB_OTG_FS.Init.Host_channels:%d\r\n", usb->Host_channels);
    cdcprintf("hpcd_USB_OTG_FS.Init.dma_enable:%d\r\n", usb->dma_enable);
    cdcprintf("hpcd_USB_OTG_FS.Init.speed:%d\r\n", usb->speed);
    cdcprintf("hpcd_USB_OTG_FS.Init.ep0_mps:%d\r\n", usb->ep0_mps);
    cdcprintf("hpcd_USB_OTG_FS.Init.phy_itface:%d\r\n", usb->phy_itface);
    cdcprintf("hpcd_USB_OTG_FS.Init.Sof_enable:%d\r\n", usb->Sof_enable);
    cdcprintf("hpcd_USB_OTG_FS.Init.low_power_enable:%d\r\n", usb->low_power_enable);
    cdcprintf("hpcd_USB_OTG_FS.Init.lpm_enable:%d\r\n", usb->lpm_enable);
    cdcprintf("hpcd_USB_OTG_FS.Init.battery_charging_enable:%d\r\n", usb->battery_charging_enable);
    cdcprintf("hpcd_USB_OTG_FS.Init.vbus_sensing_enable:%d\r\n", usb->vbus_sensing_enable);
    cdcprintf("hpcd_USB_OTG_FS.Init.use_dedicated_ep1:%d\r\n", usb->use_dedicated_ep1);
    cdcprintf("hpcd_USB_OTG_FS.Init.use_external_vbus:%d\r\n", usb->use_external_vbus);
}

void ProcessLine(void)
{
    char cmd[16];
    float f1, f2;
    int   i1;
    // int  arg1, arg2;

    if (sscanf((char *)lineBuf, "%s %f %f", cmd, &f1, &f2) == 3)
    {
        printf(" cmd: %s, f1: %.3f, f2: %.3f\r\n", cmd, f1, f2);
    }
    else if (sscanf((char *)lineBuf, "%s %f", cmd, &f1) == 2)
    {
        printf(" cmd: %s, f1: %.3f\r\n", cmd, f1);
    }
    else if (sscanf((char *)lineBuf, "%s %d", cmd, &i1) == 2)
    {
        printf(" cmd: %s, i1: %d\r\n", cmd, i1);
    }
    else if (sscanf((char *)lineBuf, "%s", cmd) == 1)
    {
        if      (strcmp(cmd, "help")   == 0) printf("commands: help, cls, reset\r\n");
        else if (strcmp(cmd, "cls")    == 0) printf("\033[2J\033[H>");
        else if (strcmp(cmd, "reset")  == 0) NVIC_SystemReset();
        else if (strcmp(cmd, "uptime") == 0) printf("uptime: %lu ms\r\n", HAL_GetTick());
        else                                 printf("unknown command: %s\r\n", cmd);
    }
    else
    {
        printf("unknown command\r\n");
    }
}

